:- dynamic animal/13.

animal(кот,0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1).
animal(собака,0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(лошадь,0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(корова,0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(свинь€,0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(овца,0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1).
animal(коза,0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1).
animal(курица,0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1).
animal(утка,1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1).
animal(попугай,0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1).
animal(тигр,0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(лев,0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(слон,0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(медведь,0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(волк,0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(лиса,0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(жираф,0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(зебра,0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(носорог,0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1).
animal(кенгуру,0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1).
animal(орЄл,0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1).
animal(пингвин,1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1).
animal(кит,1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1).
animal(дельфин,1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1).
animal(акула,1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1).
animal(тюлень,1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1).
animal(крокодил,1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1).
animal(лебедь,1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1).
animal(страус,0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1).
animal(летуча€_мышь,0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1).

question1(X) :- write("1. ∆ивЄт ли животное в воде? (1 Ч да, 0 Ч нет): "), read(X).
question2(X) :- write("2. ƒомашнее ли это животное? (1 Ч да, 0 Ч нет): "), read(X).
question3(X) :- write("3. ≈сть ли у него шерсть? (1 Ч да, 0 Ч нет): "), read(X).
question4(X) :- write("4. ”меет ли оно летать? (1 Ч да, 0 Ч нет): "), read(X).
question5(X) :- write("5. явл€етс€ ли оно хищником? (1 Ч да, 0 Ч нет): "), read(X).
question6(X) :- write("6. ≈сть ли у него копыта? (1 Ч да, 0 Ч нет): "), read(X).
question7(X) :- write("7. Ёто млекопитающее? (1 Ч да, 0 Ч нет): "), read(X).
question8(X) :- write("8. Ёто птица? (1 Ч да, 0 Ч нет): "), read(X).
question9(X) :- write("9. ≈сть ли у него клюв? (1 Ч да, 0 Ч нет): "), read(X).
question10(X):- write("10. ќно траво€дное? (1 Ч да, 0 Ч нет): "), read(X).
question11(X):- write("11. ћожно ли встретить его в зоопарке? (1 Ч да, 0 Ч нет): "), read(X).
question12(X):- write("12. ∆ивотное активно днЄм? (1 Ч да, 0 Ч нет): "), read(X).

guess_animal :-
    question1(A1), question2(A2), question3(A3),
    question4(A4), question5(A5), question6(A6),
    question7(A7), question8(A8), question9(A9),
    question10(A10), question11(A11), question12(A12),
    animal(Name, A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11),
    format("¬ы загадали: ~w~n", [Name]), !.

guess_animal :-
    write("∆ивотное с такими признаками не найдено."), nl
